Revit 2026 API

# OpenOptionsGetOpenWorksetsConfiguration Method

---

Gets the object used to configure the worksets to open when the model is opened.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksetConfiguration GetOpenWorksetsConfiguration()
```
```vb
Public Function GetOpenWorksetsConfiguration As WorksetConfiguration
```
```cpp
public:
WorksetConfiguration^ GetOpenWorksetsConfiguration()
```
```fsharp
member GetOpenWorksetsConfiguration : unit -> WorksetConfiguration
```

#### Return Value

WorksetConfiguration The options. If , all user-created worksets will be opened.

#### Reference

OpenOptions Class

Autodesk.Revit.DB Namespace